zsf90/GD32F150_CoreBoard/freertos_demo/FreeRTOS_Key_Demo/FreeRTOS/include/FreeRTOSConfig.h
/*
 * FreeRTOS V202112.00
 * Copyright (C) 2020 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://www.FreeRTOS.org
 * http://aws.amazon.com/freertos
 *
 * 1 tab == 4 spaces!
 */

#ifndef FREERTOS_CONFIG_H
#define FREERTOS_CONFIG_H

/*-----------------------------------------------------------
 * Application specific definitions.
 *
 * These definitions should be adjusted for your particular hardware and
 * application requirements.
 *
 * THESE PARAMETERS ARE DESCRIBED WITHIN THE 'CONFIGURATION' SECTION OF THE
 * FreeRTOS API DOCUMENTATION AVAILABLE ON THE FreeRTOS.org WEB SITE. 
 *
 * See http://www.freertos.org/a00110.html
 *----------------------------------------------------------*/
#include "gd32f1x0.h"

#define configUSE_PREEMPTION		1   // 1: 使能抢占式调度器 0: 使能合作式调度器
#define configUSE_IDLE_HOOK			0   // 1: 使能空闲任务的钩子函数 0: 禁能空闲任务钩子函数
#define configUSE_TICK_HOOK			0   // 1: 使能滴答定时器中断里面执行的钩子函数 0: 禁能滴答定时器中断里面执行的钩子函数
#define configCPU_CLOCK_HZ			( ( unsigned long ) SystemCoreClock )	// CPU 时钟频率
#define configTICK_RATE_HZ			( ( TickType_t ) 1000 )
#define configMAX_PRIORITIES		( 5 )   // 定义最大优先等级，从零开始，数值越小优先级越低，最大等于 n-1
#define configMINIMAL_STACK_SIZE	( ( unsigned short ) 32 )   // 最小栈空间，单位字，即 4字节
#define configTOTAL_HEAP_SIZE		( ( size_t ) ( 3 * 1024 ) ) // 堆大小，用户动态内从申请、任务栈、任务创建、信号量创建、消息队列创建
#define configMAX_TASK_NAME_LEN		( 16 ) // 任务名最大字符数
#define configUSE_TRACE_FACILITY	1
#define configUSE_16_BIT_TICKS		0   
#define configIDLE_SHOULD_YIELD		1
#define configUSE_QUEUE_SETS        1 // 使能队列集合

// 定时器配置
#define configUSE_TIMERS                1 // 使用软件定时器
#define configTIMER_TASK_STACK_DEPTH    100  // 单位（字）
#define configTIMER_QUEUE_LENGTH        10
#define configTIMER_TASK_PRIORITY       4


/* Co-routine definitions. */
#define configUSE_CO_ROUTINES 		0
#define configMAX_CO_ROUTINE_PRIORITIES ( 2 )


/* Set the following definitions to 1 to include the API function, or zero
to exclude the API function. */

#define INCLUDE_vTaskPrioritySet		1
#define INCLUDE_uxTaskPriorityGet		1
#define INCLUDE_vTaskDelete				1
#define INCLUDE_vTaskCleanUpResources	0
#define INCLUDE_vTaskSuspend			1
#define INCLUDE_vTaskDelayUntil			1
#define INCLUDE_vTaskDelay				1
#define INCLUDE_xTaskGetCurrentTaskHandle 1
#define INCLUDE_xTaskGetHandle          1
#define INCLUDE_eTaskGetState           1


/* This is the raw value as per the Cortex-M3 NVIC.  Values can be 255
(lowest) to 0 (1?) (highest). */
#define configKERNEL_INTERRUPT_PRIORITY 		255
/* !!!! configMAX_SYSCALL_INTERRUPT_PRIORITY must not be set to zero !!!!
See http://www.FreeRTOS.org/RTOS-Cortex-M3-M4.html. */
#define configMAX_SYSCALL_INTERRUPT_PRIORITY 	191 /* equivalent to 0xb0, or priority 11. */


/* This is the value being used as per the ST library which permits 16
priority values, 0 to 15.  This must correspond to the
configKERNEL_INTERRUPT_PRIORITY setting.  Here 15 corresponds to the lowest
NVIC value of 255. */
#define configLIBRARY_KERNEL_INTERRUPT_PRIORITY	15

// 使能动态内存分配
#define configSUPPORT_DYNAMIC_ALLOCATION    1

// 添加宏定义
#define vPortSVCHandler SVC_Handler
#define xPortPendSVHandler PendSV_Handler
#define xPortSysTickHandler SysTick_Handler

/*
configUSE_TRACE_FACILITY 和 configUSE_STATS_FORMATTING_FUNCTIONS
都为 1 的时候，将使能函数 vTaskList() 和 vTaskGetRunTimeStats()，如果两者中任何一个为 0，那么
这两个函数都将被禁能。
*/
#define configUSE_STATS_FORMATTING_FUNCTIONS    0

#endif /* FREERTOS_CONFIG_H */

